// დაწერეთ პროგრამა, რომელიც იყენებს for loop-ს, რათა შეამოწმოს, არის თუ არა მოცემული რიცხვი (მაგ., 29) მარტივი რიცხვი. მარტივი რიცხვი იყოფა მხოლოდ 1-ზე და საკუთარ თავზე. გამოიტანეთ რიცხვი მარტივი თუ არა
// let numbers = 29
// for (let i = 0; i < numbers; i++)
//     if (numbers % 2 == 1) {
//         alert('odd')
// }    else {
//     alert('even')
// }



// დაწერეთ პროგრამა, რომელიც იყენებს for loop-ს მოცემული რიცხვის ყველა გამყოფის მოსაძებნად და დასაბეჭდად (მაგ., 36). გამყოფი არის ნებისმიერი რიცხვი, რომელიც ყოფს რიცხვს თანაბრად (ნაშთის დატოვების გარეშე).


let number = 36;

for (let i = 1; i <= number; i++) {
    if (number % i === 0) { 
        console.log(i);
    }
}
