//შექმენით ცვლადი ამ ცვლადში მომხმარებელს შემოატანინეთ   სახელი და შემდეგ თუ ეს სახელი დაემთხვევა თქვენს სახელს დაბეჭდეთ თქვენი სახელი








//შექმენით ცვლადი month ამ ცვლადში მომხმარებელს უნდა შემოატანინოთ თვე ოღონდ რიცხვების საშუალებით(მაგ. 1=იანვარი , 2=თებერვალი , 3 = მარტი) , ამ რიცხვების მეშვეობით დაადგინეთ რომელი თვეა და გამოსახეთ კონსოლში, ამისთვის აუცილებლად გამოიყენეთ switch , იმ შემთხვევაში თუ მომხმარებელმა შემოიყვანა სხვა სიტყვა ან 12 ზე მეტი რიცხვი console-ში გამოიტანოს რომ "ასეთი თვე არ არსებობს"





//2) მომხმარებელს შემოატანინეთ თვის სახელი მაგ:("იანვარი" , "თებერვალი") , თქვენი მიზანია დაადგინოთ მომხმარებლის შემოტანილი თვე სეზონის რომელი პერიოდია (ზაფხული,ზამთარი,შემოდგომა,თუ გაზაფხული)





month = prompt("enter month") 
switch(month){
    case 'december':
    case 'january':
    case 'fabruary':
        console.log('winter')
        break
    case 'march':
    case 'april':
    case 'may':
        console.log('spring') 
        break
    case 'june':
    case 'july':
    case 'august':
        console.log('summer')  
        break
    case 'september':
    case 'octomber':
    case 'november':
        console.log('autumn')

}
